<!DOCTYPE html>
<html lang="pt-br">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>JAVA SCRIPT</title>
    <link rel="stylesheet" href="/style/reset.css">
    <link rel="stylesheet" href="/style.css">
    <link rel="icon" href="/img/java-script.png">
</head>

<body>
    <header class="cabecalho">
        <a href="/index.html"><img src="/img/R.gif" alt="gif" class="cabecalho__imagem"></a>
        <nav class="navegador">
            <a href="/index.html" class="navegador__link">home</a>
            <a href="/html/sobre.html" class="navegador__link">Sobre</a>
            <a href="/html/contato.html" class="navegador__link">Contato</a>
            <a href="/html/eventos.html" class="navegador__link">Eventos</a>
        </nav>
    </header>
    <section class="artigo-texto">
        <h2 id="o_que_&eacute;_javascript">O que &eacute; JavaScript?</h2>

        <p>JavaScript &eacute; uma linguagem de script orientada a objetos e plataforma cruzada usada para tornar as
            p&aacute;ginas da Web interativas (por exemplo, com anima&ccedil;&otilde;es complexas, bot&otilde;es
            clic&aacute;veis, menus pop-up etc.). H&aacute; tamb&eacute;m vers&otilde;es mais avan&ccedil;adas do lado
            do servidor do JavaScript, como Node.js, que permitem adicionar mais funcionalidades a um site do que baixar
            arquivos (como colabora&ccedil;&atilde;o em tempo real entre v&aacute;rios computadores). Dentro de um
            ambiente de host (por exemplo, um navegador da Web), o JavaScript pode ser conectado aos objetos de seu
            ambiente para fornecer controle program&aacute;tico sobre eles.</p>
        <p>JavaScript tem uma biblioteca padr&atilde;o de objetos,
            como:&nbsp;<code>Array</code>,&nbsp;<code>Date</code>, e&nbsp;<code>Math</code>, e um conjunto de elementos
            que formam o n&uacute;cleo da linguagem, tais como: operadores, estruturas de controle e
            declara&ccedil;&otilde;es. O n&uacute;cleo do JavaScript pode ser estendido para uma variedade de
            prop&oacute;sitos, complementando assim a linguagem:</p>
        <ul>
            <li><em>O lado cliente do JavaScript</em>&nbsp;estende-se do n&uacute;cleo linguagem, fornecendo objetos
                para controlar um navegador web e seu&nbsp;<em>Document Object Model</em>&nbsp;(DOM). Por exemplo, as
                extens&otilde;es do lado do cliente permitem que uma aplica&ccedil;&atilde;o coloque elementos em um
                formul&aacute;rio HTML e responda a eventos do usu&aacute;rio, como cliques do mouse, entrada de
                formul&aacute;rio e de navega&ccedil;&atilde;o da p&aacute;gina.</li>
            <li><em>O lado do servidor do JavaScript</em>&nbsp;estende-se do n&uacute;cleo da linguagem, fornecendo
                objetos relevantes &agrave; execu&ccedil;&atilde;o do JavaScript em um servidor. Por exemplo, as
                extens&otilde;es do lado do servidor permitem que uma aplica&ccedil;&atilde;o comunique-se com um banco
                de dados, garantindo a continuidade de informa&ccedil;&otilde;es de uma chamada para a outra da
                aplica&ccedil;&atilde;o, ou executar manipula&ccedil;&otilde;es de arquivos em um servidor.</li>
        </ul>
        <p>Isso significa que, no navegador, o JavaScript pode alterar a apar&ecirc;ncia da p&aacute;gina da Web (DOM).
            E, da mesma forma, o JavaScript Node.js no servidor pode responder a solicita&ccedil;&otilde;es
            personalizadas enviadas por c&oacute;digo executado no navegador.</p>
        </div>

        <h2 id="javascript_e_java">JavaScript e Java</h2>
        <p>JavaScript e Java s&atilde;o similares em algumas coisas, mas s&atilde;o diferentes em outras. O JavaScript
            assemelha-se ao Java, por&eacute;m n&atilde;o possui tipagem est&aacute;tica e checagem rig&iacute;da de
            tipos como o Java. JavaScript segue a sintaxe b&aacute;sica do Java, conven&ccedil;&otilde;es de
            nomenclatura e constru&ccedil;&otilde;es de controle de fluxo, raz&otilde;es pelas quais esta linguagem foi
            renomeada de LiveScript para JavaScript.</p>
        <p>Em contraste com o sistema em tempo de compila&ccedil;&atilde;o das classes constru&iacute;das por
            declara&ccedil;&otilde;es no Java, JavaScript suporta um sistema em tempo de execu&ccedil;&atilde;o com base
            em um pequeno n&uacute;mero de tipos de dados representando valores num&eacute;ricos, booleanos, e strings.
            JavaScript tem um modelo de objeto baseado em prot&oacute;tipo em vez do modelo, mais comum, de objeto
            baseado em classes. O modelo baseado em prot&oacute;tipo fornece heran&ccedil;a din&acirc;mica; isto
            &eacute;, o que &eacute; herdado pode variar para objetos individuais. JavaScript tamb&eacute;m suporta
            fun&ccedil;&otilde;es sem quaisquer requisitos especiais declarativos. As fun&ccedil;&otilde;es podem ser
            propriedades de objetos, executando como m&eacute;todos.</p>
        <p>JavaScript &eacute; uma linguagem mais livre em compara&ccedil;&atilde;o a Java. Voc&ecirc; n&atilde;o tem de
            declarar todas as vari&aacute;veis, classes e m&eacute;todos. Voc&ecirc; n&atilde;o tem que se preocupar com
            o fato dos m&eacute;todos serem p&uacute;blicos, privados ou protegidos, e voc&ecirc; n&atilde;o tem que
            implementar interfaces. Vari&aacute;veis, par&acirc;metros e tipo de retorno da fun&ccedil;&atilde;o
            n&atilde;o s&atilde;o explicitamente tipados.</p>
        <p>Java &eacute; uma linguagem de programa&ccedil;&atilde;o baseada em classes, projetada para
            execu&ccedil;&atilde;o r&aacute;pida e seguran&ccedil;a de tipos. Seguran&ccedil;a de tipo significa que,
            por exemplo, voc&ecirc; n&atilde;o pode converter um n&uacute;mero inteiro em Java para uma refer&ecirc;ncia
            de objeto ou acessar a mem&oacute;ria privada corrompendo bytecodes Java. O modelo baseado em classes do
            Java significa que os programas s&atilde;o exclusivamente constitu&iacute;dos por classes e seus
            m&eacute;todos. Heran&ccedil;a de classe do Java e tipagem forte geralmente requerem hierarquias de objetos
            fortemente acoplados. Esses requisitos tornam a programa&ccedil;&atilde;o em Java mais complexa do que a
            programa&ccedil;&atilde;o em JavaScript.</p>
        <p>Em contraste, JavaScript descende em esp&iacute;rito de uma linhagem de linguagens menores com tipagem
            din&acirc;mica, como HyperTalk e dBASE. Essas linguagens de script oferecem ferramentas de
            programa&ccedil;&atilde;o para um p&uacute;blico muito mais amplo por causa de sua sintaxe mais
            f&aacute;cil, fun&ccedil;&otilde;es especializadas embutidas e requisitos m&iacute;nimos para a
            cria&ccedil;&atilde;o de objetos.</p> <br>

        <iframe class="container__video" width="560" height="315" src="https://www.youtube-nocookie.com/embed/Ptbk2af68e8?si=b5O4KN1C3sC02RZN"
            title="YouTube video player" frameborder="0"
            allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
            allowfullscreen></iframe>
    </section>
    <footer class="rodape">
        developed by codeasy company.
    </footer>

</body>

</html>